Revit 2024 API
AlphanumericRevisionSettings Class
 Contains settings that apply to Revisions with the Alphanumeric RevisionNumberType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class AlphanumericRevisionSettings : IDisposable
Visual Basic
Public Class AlphanumericRevisionSettings _
	Implements IDisposable
Visual C++
public ref class AlphanumericRevisionSettings : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AlphanumericRevisionSettings
See Also
AlphanumericRevisionSettings Members
Autodesk.Revit.DB Namespace